tests/com/l7tech/service/resources/dotNetSignedUsingDerivedKeyToken.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action wsu:Id="Id-74835be5-3038-4b43-a148-a126411db484">http://warehouse.acme.com/ws/listProducts</wsa:Action><wsa:MessageID wsu:Id="Id-da27f3c9-aec2-48c7-8830-7b52e24abb19">uuid:c51d6a55-8bad-4f48-bc73-4baf0c68b512</wsa:MessageID><wsa:ReplyTo wsu:Id="Id-ff3e537c-f38c-420a-8d6f-9ce776337ac5"><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To wsu:Id="Id-f9704e17-587c-4014-ba66-182ca47d18d5">http://riker:8888/ACMEWarehouseWS/Service1.asmx</wsa:To><wsse:Security><wsu:Timestamp wsu:Id="Timestamp-8f30df26-8c3e-40a3-8b8a-052ed34784e5"><wsu:Created>2004-08-03T21:58:09Z</wsu:Created><wsu:Expires>2004-08-03T22:03:09Z</wsu:Expires></wsu:Timestamp><wssc:SecurityContextToken wsu:Id="SecurityToken-6510fb01-b69f-4bbd-a376-78653568d670" xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc"><wssc:Identifier>uuid:41ad89ae-9968-4894-9b39-47c729ec3d3e</wssc:Identifier></wssc:SecurityContextToken><wssc:DerivedKeyToken wsu:Id="SecurityToken-b36bb294-c7de-4652-be60-3d2c210b7686" wssc:Algorithm="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk/p_sha1" xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc"><wsse:SecurityTokenReference><wsse:Reference URI="uuid:41ad89ae-9968-4894-9b39-47c729ec3d3e" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/sct" /></wsse:SecurityTokenReference><wssc:Generation>0</wssc:Generation><wssc:Length>16</wssc:Length><wssc:Label>WS-SecureConversation</wssc:Label><wsse:Nonce>nkDEfNLYQTzynWAhCk06FA==</wsse:Nonce></wssc:DerivedKeyToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1" /><Reference URI="#Id-74835be5-3038-4b43-a148-a126411db484"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>K5d2/YRrYRKZ3X6+28AaJEvFGXc=</DigestValue></Reference><Reference URI="#Id-da27f3c9-aec2-48c7-8830-7b52e24abb19"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>ECpCAdMX7aFncdNVkbUqTWRp+GY=</DigestValue></Reference><Reference URI="#Id-ff3e537c-f38c-420a-8d6f-9ce776337ac5"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>+ksMw40h+/1d2ZtXtPWB5NO+ocM=</DigestValue></Reference><Reference URI="#Id-f9704e17-587c-4014-ba66-182ca47d18d5"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>nWZPVqgL8pC4vYOSMCVH4Uz5M9k=</DigestValue></Reference><Reference URI="#Timestamp-8f30df26-8c3e-40a3-8b8a-052ed34784e5"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>IuptL2ty+1HbMTMTOEb3s8L1IXU=</DigestValue></Reference><Reference URI="#Id-25365c38-a373-48b9-88bc-2addc2970ea6"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>/FdyjwPRcagko6CJUbX8IPqA4FA=</DigestValue></Reference></SignedInfo><SignatureValue>NjxAuqJL6Hh6nCjLz3MHj1GvAZI=</SignatureValue><KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SecurityToken-b36bb294-c7de-4652-be60-3d2c210b7686" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk" /></wsse:SecurityTokenReference></KeyInfo></Signature></wsse:Security></soap:Header><soap:Body wsu:Id="Id-25365c38-a373-48b9-88bc-2addc2970ea6"><listProducts xmlns="http://warehouse.acme.com/ws" /></soap:Body></soap:Envelope>
